# dataframes panda

In [1]:
import pandas as pd

In [2]:
data={'primerNombre':['David','Ricardo','Daniel'],
       'SegundoNombre':['Aurelio','Felipe','Miguel'],
       'Estatura':[2,1.7,1.69],
       'Estudia':["Si","Si","No"]}

In [5]:
#converdir diccionario en dataframe
df=pd.DataFrame(data)

In [9]:
df

  primerNombre SegundoNombre  Estatura Estudia
0        David       Aurelio      2.00      Si
1      Ricardo        Felipe      1.70      Si
2       Daniel        Miguel      1.69      No

In [15]:
df['Estatura_in']=df['Estatura']*39.3701

In [16]:
df

  primerNombre SegundoNombre  Estatura Estudia  Estatura_in
0        David       Aurelio      2.00      Si    78.740200
1      Ricardo        Felipe      1.70      Si    66.929170
2       Daniel        Miguel      1.69      No    66.535469

In [17]:
df.dtypes

primerNombre      object
SegundoNombre     object
Estatura         float64
Estudia           object
Estatura_in      float64
dtype: object

In [18]:

df['Estudia']=df['Estudia'].astype('category')

In [23]:
df.dtypes

primerNombre       object
SegundoNombre      object
Estatura          float64
Estudia          category
Estatura_in       float64
Apellidos          object
dtype: object

In [21]:
df['Apellidos']=['Ramirez','Moreno','Bernal']

In [22]:
df

  primerNombre SegundoNombre  Estatura Estudia  Estatura_in Apellidos
0        David       Aurelio      2.00      Si    78.740200   Ramirez
1      Ricardo        Felipe      1.70      Si    66.929170    Moreno
2       Daniel        Miguel      1.69      No    66.535469    Bernal

In [24]:
df.shape

(3, 6)

In [25]:
df['codigo']=["L1","G1","P1"]

In [26]:
df.set_index('codigo',inplace=True)

In [30]:
df

       primerNombre SegundoNombre  Estatura Estudia  Estatura_in Apellidos
codigo
L1            David       Aurelio      2.00      Si    78.740200   Ramirez
G1          Ricardo        Felipe      1.70      Si    66.929170    Moreno
P1           Daniel        Miguel      1.69      No    66.535469    Bernal

In [34]:
#dropear una columna, axis ->especificar si es fila o columna
df.drop(['codigo2'],axis=1)

       primerNombre SegundoNombre  Estatura Estudia  Estatura_in Apellidos
codigo
L1            David       Aurelio      2.00      Si    78.740200   Ramirez
G1          Ricardo        Felipe      1.70      Si    66.929170    Moreno
P1           Daniel        Miguel      1.69      No    66.535469    Bernal

In [35]:
df.to_excel('datos.xlsx',sheet_name='Datos')
df.to_csv('Datos.csv')

In [39]:
df=df.drop(['codigo2'],axis=1)

In [40]:
df

       primerNombre SegundoNombre  Estatura Estudia  Estatura_in Apellidos
codigo
L1            David       Aurelio      2.00      Si    78.740200   Ramirez
G1          Ricardo        Felipe      1.70      Si    66.929170    Moreno
P1           Daniel        Miguel      1.69      No    66.535469    Bernal

In [41]:
df.iloc[1]

primerNombre     Ricardo
SegundoNombre     Felipe
Estatura             1.7
Estudia               Si
Estatura_in      66.9292
Apellidos         Moreno
Name: G1, dtype: object

In [42]:
df.loc['G1']

primerNombre     Ricardo
SegundoNombre     Felipe
Estatura             1.7
Estudia               Si
Estatura_in      66.9292
Apellidos         Moreno
Name: G1, dtype: object

In [43]:
df.loc['G1','Estudia']

'Si'

In [44]:
df.sort_index()

       primerNombre SegundoNombre  Estatura Estudia  Estatura_in Apellidos
codigo
G1          Ricardo        Felipe      1.70      Si    66.929170    Moreno
L1            David       Aurelio      2.00      Si    78.740200   Ramirez
P1           Daniel        Miguel      1.69      No    66.535469    Bernal

In [45]:
df.sort_index(ascending=False)

       primerNombre SegundoNombre  Estatura Estudia  Estatura_in Apellidos
codigo
P1           Daniel        Miguel      1.69      No    66.535469    Bernal
L1            David       Aurelio      2.00      Si    78.740200   Ramirez
G1          Ricardo        Felipe      1.70      Si    66.929170    Moreno

In [50]:
df.sort_values(by=['Estatura'],ascending=False)

       primerNombre SegundoNombre  Estatura Estudia  Estatura_in Apellidos
codigo
L1            David       Aurelio      2.00      Si    78.740200   Ramirez
G1          Ricardo        Felipe      1.70      Si    66.929170    Moreno
P1           Daniel        Miguel      1.69      No    66.535469    Bernal

In [53]:
filtro=df['Estudia']=="Si"
df[~filtro]

       primerNombre SegundoNombre  Estatura Estudia  Estatura_in Apellidos
codigo
P1           Daniel        Miguel      1.69      No    66.535469    Bernal

In [56]:
filtro2=(df['Estudia']=="Si") & (df['Estatura']>1.70)
df[filtro2]

       primerNombre SegundoNombre  Estatura Estudia  Estatura_in Apellidos
codigo
L1            David       Aurelio       2.0      Si      78.7402   Ramirez